grevaillot/svd_tools/headers/ATSAM3X8H/usart1.h
/** @defgroup usart1_csr CSR Channel Status Register
@{*/

/** USART1_CSR_MANERR Manchester Error **/
#define USART1_CSR_MANERR		(1 << 24)
/** USART1_CSR_CTS Image of CTS Input **/
#define USART1_CSR_CTS		(1 << 23)
/** USART1_CSR_CTSIC Clear to Send Input Change Flag **/
#define USART1_CSR_CTSIC		(1 << 19)
/** USART1_CSR_NACK Non Acknowledge Interrupt **/
#define USART1_CSR_NACK		(1 << 13)
/** USART1_CSR_RXBUFF Reception Buffer Full **/
#define USART1_CSR_RXBUFF		(1 << 12)
/** USART1_CSR_TXBUFE Transmission Buffer Empty **/
#define USART1_CSR_TXBUFE		(1 << 11)
/** USART1_CSR_ITER Max Number of Repetitions Reached **/
#define USART1_CSR_ITER		(1 << 10)
/** USART1_CSR_TXEMPTY Transmitter Empty **/
#define USART1_CSR_TXEMPTY		(1 << 9)
/** USART1_CSR_TIMEOUT Receiver Time-out **/
#define USART1_CSR_TIMEOUT		(1 << 8)
/** USART1_CSR_PARE Parity Error **/
#define USART1_CSR_PARE		(1 << 7)
/** USART1_CSR_FRAME Framing Error **/
#define USART1_CSR_FRAME		(1 << 6)
/** USART1_CSR_OVRE Overrun Error **/
#define USART1_CSR_OVRE		(1 << 5)
/** USART1_CSR_ENDTX End of Transmitter Transfer **/
#define USART1_CSR_ENDTX		(1 << 4)
/** USART1_CSR_ENDRX End of Receiver Transfer **/
#define USART1_CSR_ENDRX		(1 << 3)
/** USART1_CSR_RXBRK Break Received/End of Break **/
#define USART1_CSR_RXBRK		(1 << 2)
/** USART1_CSR_TXRDY Transmitter Ready **/
#define USART1_CSR_TXRDY		(1 << 1)
/** USART1_CSR_RXRDY Receiver Ready **/
#define USART1_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART1_CSR_SPI_MODE_RXBUFF  **/
#define USART1_CSR_SPI_MODE_RXBUFF		(1 << 12)
/** USART1_CSR_SPI_MODE_TXBUFE  **/
#define USART1_CSR_SPI_MODE_TXBUFE		(1 << 11)
/** USART1_CSR_SPI_MODE_UNRE Underrun Error **/
#define USART1_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART1_CSR_SPI_MODE_TXEMPTY Transmitter Empty **/
#define USART1_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_CSR_SPI_MODE_OVRE Overrun Error **/
#define USART1_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART1_CSR_SPI_MODE_ENDTX  **/
#define USART1_CSR_SPI_MODE_ENDTX		(1 << 4)
/** USART1_CSR_SPI_MODE_ENDRX  **/
#define USART1_CSR_SPI_MODE_ENDRX		(1 << 3)
/** USART1_CSR_SPI_MODE_TXRDY Transmitter Ready **/
#define USART1_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_CSR_SPI_MODE_RXRDY Receiver Ready **/
#define USART1_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr_lin_mode CSRLINMODE Channel Status Register
@{*/

/** USART1_CSR_LIN_MODE_LINSNRE LIN Slave Not Responding Error **/
#define USART1_CSR_LIN_MODE_LINSNRE		(1 << 29)
/** USART1_CSR_LIN_MODE_LINCE LIN Checksum Error **/
#define USART1_CSR_LIN_MODE_LINCE		(1 << 28)
/** USART1_CSR_LIN_MODE_LINIPE LIN Identifier Parity Error **/
#define USART1_CSR_LIN_MODE_LINIPE		(1 << 27)
/** USART1_CSR_LIN_MODE_LINISFE LIN Inconsistent Synch Field Error **/
#define USART1_CSR_LIN_MODE_LINISFE		(1 << 26)
/** USART1_CSR_LIN_MODE_LINBE LIN Bit Error **/
#define USART1_CSR_LIN_MODE_LINBE		(1 << 25)
/** USART1_CSR_LIN_MODE_LINBLS LIN Bus Line Status **/
#define USART1_CSR_LIN_MODE_LINBLS		(1 << 23)
/** USART1_CSR_LIN_MODE_LINTC LIN Transfer Completed **/
#define USART1_CSR_LIN_MODE_LINTC		(1 << 15)
/** USART1_CSR_LIN_MODE_LINID LIN Identifier Sent or LIN Identifier Received **/
#define USART1_CSR_LIN_MODE_LINID		(1 << 14)
/** USART1_CSR_LIN_MODE_LINBK LIN Break Sent or LIN Break Received **/
#define USART1_CSR_LIN_MODE_LINBK		(1 << 13)
/** USART1_CSR_LIN_MODE_RXBUFF  **/
#define USART1_CSR_LIN_MODE_RXBUFF		(1 << 12)
/** USART1_CSR_LIN_MODE_TXBUFE  **/
#define USART1_CSR_LIN_MODE_TXBUFE		(1 << 11)
/** USART1_CSR_LIN_MODE_TXEMPTY Transmitter Empty **/
#define USART1_CSR_LIN_MODE_TXEMPTY		(1 << 9)
/** USART1_CSR_LIN_MODE_TIMEOUT Receiver Time-out **/
#define USART1_CSR_LIN_MODE_TIMEOUT		(1 << 8)
/** USART1_CSR_LIN_MODE_PARE Parity Error **/
#define USART1_CSR_LIN_MODE_PARE		(1 << 7)
/** USART1_CSR_LIN_MODE_FRAME Framing Error **/
#define USART1_CSR_LIN_MODE_FRAME		(1 << 6)
/** USART1_CSR_LIN_MODE_OVRE Overrun Error **/
#define USART1_CSR_LIN_MODE_OVRE		(1 << 5)
/** USART1_CSR_LIN_MODE_ENDTX  **/
#define USART1_CSR_LIN_MODE_ENDTX		(1 << 4)
/** USART1_CSR_LIN_MODE_ENDRX  **/
#define USART1_CSR_LIN_MODE_ENDRX		(1 << 3)
/** USART1_CSR_LIN_MODE_TXRDY Transmitter Ready **/
#define USART1_CSR_LIN_MODE_TXRDY		(1 << 1)
/** USART1_CSR_LIN_MODE_RXRDY Receiver Ready **/
#define USART1_CSR_LIN_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_rhr RHR Receive Holding Register
@{*/

/** USART1_RHR_RXSYNH Received Sync **/
#define USART1_RHR_RXSYNH		(1 << 15)

#define USART1_RHR_RXCHR_SHIFT		0
#define USART1_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart1_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_thr THR Transmit Holding Register
@{*/

/** USART1_THR_TXSYNH Sync Field to be Transmitted **/
#define USART1_THR_TXSYNH		(1 << 15)

#define USART1_THR_TXCHR_SHIFT		0
#define USART1_THR_TXCHR_MASK		0x1ff
/** @defgroup usart1_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_brgr BRGR Baud Rate Generator Register
@{*/


#define USART1_BRGR_FP_SHIFT		16
#define USART1_BRGR_FP_MASK		0x07
/** @defgroup usart1_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART1_BRGR_CD_SHIFT		0
#define USART1_BRGR_CD_MASK		0xffff
/** @defgroup usart1_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rtor RTOR Receiver Time-out Register
@{*/


#define USART1_RTOR_TO_SHIFT		0
#define USART1_RTOR_TO_MASK		0x1ffff
/** @defgroup usart1_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART1_TTGR_TG_SHIFT		0
#define USART1_TTGR_TG_MASK		0xff
/** @defgroup usart1_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_fidi FIDI FI DI Ratio Register
@{*/


#define USART1_FIDI_FI_DI_RATIO_SHIFT		0
#define USART1_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart1_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ner NER Number of Errors Register
@{*/


#define USART1_NER_NB_ERRORS_SHIFT		0
#define USART1_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart1_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

