grevaillot/svd_tools/headers/ATSAM3X8H/usart1.h
/** @defgroup usart1_if IF IrDA Filter Register
@{*/


#define USART1_IF_IRDA_FILTER_SHIFT		0
#define USART1_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart1_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_man MAN Manchester Configuration Register
@{*/

/** USART1_MAN_DRIFT Drift Compensation **/
#define USART1_MAN_DRIFT		(1 << 30)
/** USART1_MAN_ONE Must Be Set to 1 **/
#define USART1_MAN_ONE		(1 << 29)
/** USART1_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART1_MAN_RX_MPOL		(1 << 28)

#define USART1_MAN_RX_PP_SHIFT		24
#define USART1_MAN_RX_PP_MASK		0x03
/** @defgroup usart1_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART1_MAN_RX_PL_SHIFT		16
#define USART1_MAN_RX_PL_MASK		0x0f
/** @defgroup usart1_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART1_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART1_MAN_TX_MPOL		(1 << 12)

#define USART1_MAN_TX_PP_SHIFT		8
#define USART1_MAN_TX_PP_MASK		0x03
/** @defgroup usart1_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART1_MAN_TX_PL_SHIFT		0
#define USART1_MAN_TX_PL_MASK		0x0f
/** @defgroup usart1_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_linmr LINMR LIN Mode Register
@{*/

/** USART1_LINMR_PDCM PDC Mode **/
#define USART1_LINMR_PDCM		(1 << 16)

#define USART1_LINMR_DLC_SHIFT		8
#define USART1_LINMR_DLC_MASK		0xff
/** @defgroup usart1_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART1_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART1_LINMR_WKUPTYP		(1 << 7)
/** USART1_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART1_LINMR_FSDIS		(1 << 6)
/** USART1_LINMR_DLM Data Length Mode **/
#define USART1_LINMR_DLM		(1 << 5)
/** USART1_LINMR_CHKTYP Checksum Type **/
#define USART1_LINMR_CHKTYP		(1 << 4)
/** USART1_LINMR_CHKDIS Checksum Disable **/
#define USART1_LINMR_CHKDIS		(1 << 3)
/** USART1_LINMR_PARDIS Parity Disable **/
#define USART1_LINMR_PARDIS		(1 << 2)

#define USART1_LINMR_NACT_SHIFT		0
#define USART1_LINMR_NACT_MASK		0x03
/** @defgroup usart1_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_linir LINIR LIN Identifier Register
@{*/


#define USART1_LINIR_IDCHR_SHIFT		0
#define USART1_LINIR_IDCHR_MASK		0xff
/** @defgroup usart1_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_linbrr LINBRR LIN Baud Rate Register
@{*/


#define USART1_LINBRR_LINFP_SHIFT		16
#define USART1_LINBRR_LINFP_MASK		0x07
/** @defgroup usart1_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART1_LINBRR_LINCD_SHIFT		0
#define USART1_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart1_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_wpmr WPMR Write Protection Mode Register
@{*/


#define USART1_WPMR_WPKEY_SHIFT		8
#define USART1_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart1_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART1_WPMR_WPEN Write Protection Enable **/
#define USART1_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart1_wpsr WPSR Write Protection Status Register
@{*/


#define USART1_WPSR_WPVSRC_SHIFT		8
#define USART1_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart1_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART1_WPSR_WPVS Write Protection Violation Status **/
#define USART1_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart1_rpr RPR Receive Pointer Register
@{*/


#define USART1_RPR_RXPTR_SHIFT		0
#define USART1_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart1_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rcr RCR Receive Counter Register
@{*/


#define USART1_RCR_RXCTR_SHIFT		0
#define USART1_RCR_RXCTR_MASK		0xffff
/** @defgroup usart1_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_tpr TPR Transmit Pointer Register
@{*/


#define USART1_TPR_TXPTR_SHIFT		0
#define USART1_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart1_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_tcr TCR Transmit Counter Register
@{*/


#define USART1_TCR_TXCTR_SHIFT		0
#define USART1_TCR_TXCTR_MASK		0xffff
/** @defgroup usart1_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rnpr RNPR Receive Next Pointer Register
@{*/


#define USART1_RNPR_RXNPTR_SHIFT		0
#define USART1_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup usart1_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rncr RNCR Receive Next Counter Register
@{*/


#define USART1_RNCR_RXNCTR_SHIFT		0
#define USART1_RNCR_RXNCTR_MASK		0xffff
/** @defgroup usart1_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_tnpr TNPR Transmit Next Pointer Register
@{*/


#define USART1_TNPR_TXNPTR_SHIFT		0
#define USART1_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup usart1_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_tncr TNCR Transmit Next Counter Register
@{*/


#define USART1_TNCR_TXNCTR_SHIFT		0
#define USART1_TNCR_TXNCTR_MASK		0xffff
/** @defgroup usart1_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ptcr PTCR Transfer Control Register
@{*/

/** USART1_PTCR_TXTDIS Transmitter Transfer Disable **/
#define USART1_PTCR_TXTDIS		(1 << 9)
/** USART1_PTCR_TXTEN Transmitter Transfer Enable **/
#define USART1_PTCR_TXTEN		(1 << 8)
/** USART1_PTCR_RXTDIS Receiver Transfer Disable **/
#define USART1_PTCR_RXTDIS		(1 << 1)
/** USART1_PTCR_RXTEN Receiver Transfer Enable **/
#define USART1_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup usart1_ptsr PTSR Transfer Status Register
@{*/

/** USART1_PTSR_TXTEN Transmitter Transfer Enable **/
#define USART1_PTSR_TXTEN		(1 << 8)
/** USART1_PTSR_RXTEN Receiver Transfer Enable **/
#define USART1_PTSR_RXTEN		(1 << 0)

/**@}*/
